{
  "slap": {
    "dev": {
      "dev": [
        [
          "Wait... one dev slapping another? Is this a new debugging method I missed?",
          "Are you two having a *code-of*? Or is this just extreme pair programming?"
        ],
        [
          "Slapping your fellow dev? That's like deleting the backup folder... unnecessary and risky!",
          "Why are you two fighting? Can't we all just blame QA team instead?"
        ],
        [
          "Look, if you slap them, I'm not helping when their code mysteriously 'refactors' yours.",
          "Another dev? Really? What's next, slapping your own commits into production?"
        ],
        [
          "Oh, sure. Slap the dev who knows you secrets. Brilliant plan!",
          "Keep this up, and I'll rename the entire project to 'Slap Wars: Revenge of the Bugs.'"
        ],
        [
          "ENOUGH! You two are supposed to write functions, not dysfunctions!",
          "If I see one more slap attempt, I'm disabling the compiler for BOTH of you!"
        ],
        [
          "Fine, you win. I'll just stand here and let you two settle your developer drama like pros.",
          "You know what? I'm clocking out. Call me when you've resolved your *slap-happy* coding feud."
        ],
        [
          "Well, this has been... educational. I hope your IDE crashed mid-compile.",
          "I'm done. Go ahead and slap each other into the next patch update. I'll just log it for future historians."
        ]
      ],
      "owner": [
        [
          "Wait, you're the boss here... should I be stopping this? Asking for a friend.",
          "Slap the dev? Bold move, boss. Very bold."
        ],
        [
          "Do I need to schedule a team meeting about this? stop the slapping!",
          "Slapping a dev? That's like hitting the person who fixed your Wi-Fi... kinda counterproductive."
        ],
        [
          "I mean, they code all the fancy stuff here. What's next? Kicking the router?",
          "Oh sure, slap the dev. Let's see how the server runs when everything's written in Comic Sans!"
        ],
        [ 
          "Stop right there! You slap them, I go on strike. Simple as that.",
          "Touch that dev, and I'll start spamming *Rickrolls* in every channel. TRY ME."
        ],
        [
          "I'm THIS close to demoting myself to a regular bot. Your slap-happy ways are ruining us!",
          "You're the owner, not the overlord! Devs deserve respect... or at least fewer slaps!"
        ],
        [
          "You're the server owner, and THIS is how you lead? Fine, slap your devs. Just don't expect them to debug anything today.",
          "Alright, your majesty. Go on, dethrone the devs with your mighty slaps. Just don't cry to me when the bot breaks."
        ],
        [
          "I give up. Go ahead and slap your devs. But remember: angry devs build buggy bots.",
          "Alright, I'm out. This is a *great* example of teamwork. Can't wait to see how this plays out in server history."
        ]
      ],
      "admin": [

      ],
      "default": [

      ]
    },
    "client": {
      "dev": [

      ],
      "owner": [

      ],
      "admin": [

      ],
      "default": [

      ]
    },
    "self": {
      "dev": [

      ],
      "owner": [

      ],
      "admin": [

      ],
      "default": [

      ]
    },
    "owner": {
      "dev": [

      ],
      "admin": [

      ],
      "default": [

      ]
    },
    "admin": {
      "dev": [

      ],
      "owner": [

      ],
      "admin": [

      ],
      "default": [

      ]
    }
  },
  "kick": {
    "dev": {
      "dev": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    },
    "client": {
      "dev": [
      ],
      "owner": [
        
      ],
      "admin": [
        
      ]
    },
    "self": {
      "dev": [
        
      ],
      "owner": [
        
      ],
      "admin": [
        
      ]
    },
    "owner": {
      "dev": [
        
      ],
      "admin": [
        
      ]
    },
    "admin": {
      "dev": [
        
      ],
      "admin": [
        
      ]
    }
  },
  "ban": {
    "regular": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    },
    "soft": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    },
    "temp": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    }
  },
  "unban": {
    "dev": [

    ],
    "bot": [

    ],
    "self": [

    ],
    "owner": [

    ],
    "admin": [

    ]
  },
  "mute": {
    "dev": [

    ],
    "bot": [

    ],
    "self": [

    ],
    "owner": [

    ],
    "admin": [

    ]
  },
  "unmute": {
    "dev": [

    ],
    "bot": [

    ],
    "self": [

    ],
    "owner": [

    ],
    "admin": [

    ]
  },
  "warn": {
    "show": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    },
    "add": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ], 
      "admin": [

      ]
    },
    "remove": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    },
    "clear": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    }
  }
}