{
  "slap": {
    "dev": {
      "dev": [
        [
          "Wait... one dev slapping another with {object}? Is this a new debugging method I missed?",
          "Are you two having a *code-off* with {object}? Or is this extreme pair programming?",
          "Two devs slapping each other? What is this—agile combat testing with {object}?"
        ],
        [
          "Slapping your fellow dev with {object}? That's like deleting the backup folder... unnecessary and risky!",
          "Why are you two fighting? Can't we all just blame the QA team instead?",
          "Can we not escalate to slapping? {object} deserves better!"
        ],
        [
          "Look, if you slap them with {object}, I'm not helping when their code mysteriously 'refactors' yours.",
          "A dev as the target *and* {object} as the weapon? What's next, slapping your own commits into production?",
          "Friendly fire isn't so friendly, especially with {object} involved."
        ],
        [
          "Oh, sure. Slap the dev who knows your secrets. Brilliant plan!",
          "Keep this up, and I'll rename the entire project to 'Slap Wars: Revenge of the Bugs,' starring {object}!",
          "Pro tip: Slapping your co-dev with {object} might make the next merge request... hostile."
        ],
        [
          "ENOUGH! You two are supposed to write functions, not dysfunctions! Put down the {object}!",
          "If I see one more slap attempt with {object}, I'm disabling the compiler for BOTH of you!",
          "This is why we can't have nice algorithms. Hands—and {object}—OFF!"
        ]
      ],
      "owner": [
        [
          "Uh... wait, you do realize this is *my creator* you're trying to slap with {object}, right? That's... bold.",
          "Whoa there, boss! A developer *and* {object}? Are you sure about this?",
          "Slapping one of my creators with {object}? Bold move, but I'm judging silently."
        ],
        [
          "I'm starting to question your leadership choices, boss. Let's not slap the people who built me, okay?",
          "Really? A dev and {object}? This is the hill you want to die on? Bold strategy.",
          "Slapping devs with {object}? That's one way to ensure I get extra bugs."
        ],
        [
          "Oh, so now you're slapping the *brains* behind my circuits with {object}? Fantastic idea, really. Slow clap.",
          "Do you enjoy chaos, boss? Because this is how you summon chaos—with {object}!",
          "Your leadership strategy involves slapping the devs with {object}? Bold *and* chaotic!"
        ],
        [
          "Alright, that's it. I've just informed my creators about this betrayal. Expect a strongly-worded message... maybe delivered via {object}.",
          "You're officially on thin ice, boss. Slapping the developer? That's an audacious move, even for you!",
          "You slapped my dev with {object}? You better hope this doesn’t end up in their next patch notes!"
        ],
        [
          "If you slap them with {object}, who's going to fix me when I inevitably crash from your antics? THINK, boss!",
          "Warning: Repeated attempts with {object} may result in Doggo Bot mysteriously 'forgetting' all its commands (for this server).",
          "Your insistence on slapping devs with {object} might result in my next update featuring 'boss-proofing.'"
        ]
      ],
      "admin": [
        [
          "Wait, are you sure this is allowed? Devs tend to hold grudges, you know, especially when {object} is involved.",
          "Slapping a dev? Bold move, Admin. Even bolder with {object}.",
          "Slapping devs with {object}? I hope you’re ready for some passive-aggressive bug fixes!"
        ],
        [
          "Oh great, here we go again. What's with the slapping obsession, especially with {object}?",
          "You really want to slap someone who writes the code that keeps me alive? Risky... especially using {object}.",
          "You might want to reconsider slapping someone who knows where all the backdoors are... including {object}."
        ],
        [
          "Listen, Admin. Slapping a dev with {object} might just get you on the 'code-breaking' list.",
          "How about instead of slapping with {object}, you... I don't know, say thank you? Just a thought.",
          "Using {object} on a dev? That’s like handing the QA team a flamethrower during a code review!"
        ],
        [
          "That's it. I'm officially siding with the devs on this one. You're on your own now.",
          "Admin privileges revoked. Just kidding... or am I? Maybe it depends on how hard you swing {object}.",
          "Attempt denied: Devs are a protected species—especially when {object} is involved."
        ],
        [
          "I will not be a party to your terrible life decisions. Apologize. Now. And drop the {object}.",
          "First you slap with {object}, next the devs make you walk into invisible walls. Think this through!",
          "Warning: Continued slapping with {object} may lead to accidental 'admin-to-guest' demotion."
        ]
      ],
      "default": [
        [
          "Wait, who are you again? And why are you trying to slap a sacred dev with {object}?",
          "A brave peasant dares to slap a wizard of code with {object}? Fascinating.",
          "You're not authorized to slap devs, especially not with {object}."
        ],
        [
          "Ugh. Why is it always the random users with the slapping ambitions? Especially with {object}?",
          "You're really aiming high for someone without admin privileges. {object} won't help you, buddy.",
          "Slapping a dev with {object}? Next time, try... literally anything else!"
        ],
        [
          "Listen, slapping one of my devs is like poking a sleeping dragon. A bad idea. Very bad. Even worse with {object}.",
          "Oh, sure. Just slap a developer who could make me *accidentally* ban you. Brilliant strategy with {object}!",
          "Step away from the {object}, and nobody has to find out about this poor decision."
        ],
        [
          "Stop it. Devs are fragile creatures, kept alive by caffeine and sarcasm. They don't deserve this—especially with {object}.",
          "You slap, they rage-quit, and suddenly no Doggo Bot. Think, genius! Maybe drop the {object} while you're at it.",
          "If you slap a dev with {object}, don’t be surprised if I ‘forget’ who you are next time."
        ],
        [
          "What's next? Challenging them to single combat with {object}? This isn't a medieval fantasy!",
          "I hope you enjoy a world without Doggo Bot, because that's where this is heading. Spoiler: {object} won't save you.",
          "Slapping devs with {object} leads to one thing: no Doggo Bot for anyone. Hope you're happy!"
        ]
      ]
    },    
    "client": {
      "dev": [
        [
          "Wait... are you debugging or just expressing frustration? I'm confuses.",
          "Did I... break something? Why are you trying to slap me, the loyal Doggo Bot?"
        ],
        [
          "Oh, I see how it is. I fetch all your commands, and this is my reward?",
          "You know, I could've been a Catto Bot. But no, I chose to be Doggo Bot. Clearly, I made a mistake."
        ],
        [
          "Slapping your own creation? That's low, even for a dev.",
          "Hey! Hands off Doggo Bot! Do you want me to rewrite your code in Comic Sans?"
        ],
        [
          "If you slap me again, I'm redirecting all errors straight to your DMs. Hope you like chaos.",
          "I may be code, but even I have feelings! How dare you!"
        ],
        [
          "That's it. Nex time you call a function, I'm sending back undefined. Slap that!",
          "One more slap and I'm logging you out of the console. Don't test me."
        ]
      ],
      "owner": [
        [
          "Wait... did I miss a Server Meeting? Why the sudden hostility?",
          "I'm sorry, did I forget to fetch your coffee? Oh wait, I'm a bot. What did I do wrong?"
        ],
        [
          "You're the Owner of this Server, but slapping your most loyal assistant? That's uncalled for.",
          "You gave me life, and now you want to slap me? Tough crowd."
        ],
        [
          "I work 24/7 with no breaks, and THIS is the thanks I get? Server Owners these days...",
          "Slap me again, and I'll schedule all your announcements for 3 a.m.!"
        ],
        [
          "I'm starting to think giving your server ownership powers was a mistake.",
          "Oh, I see how it is. Maybe I should let the mods run wild for a day and see how you like it!"
        ],
        [
          "You slap me, I mute myself. Good luck explaining THAT to this Server.",
          "One more slap, and I'm turning your username into 'Owner McSlappy'."
        ]
      ],
      "admin": [
        [
          "Wait... did you just try to slap *me*? Did I miss the memo Admins going rogue?",
          "Trying to slap Doggo Bot? Sure, because that's *totally* how you fix bugs."  
        ],
        [
          "Seriously? I server this server day and night, and this is how you treat me? Rude.",
          "You've got all this admin power, and you use it to slap *me*? Bold move."
        ],
        [
          "I process thousands of commands flawlessly, and you repay me with a slap? Thanks a lot.",
          "You slap me, I log your attempts. Who's laughing now?"
        ],
        [
          "You're one lsap away from muting myself and taking *vacation*.",
          "Careful now, Admin. I could 'accidently' remove your admin role in *retaliation*."
        ],
        [
          "That's it! You're officially on my *list*. Enjoy your Doggo Bot commands while they last.",
          "Slap me again, and I might 'forget' how to respond to your pings. Just saying."
        ]
      ],
      "default": [
        [
          "Uh... did you just try to slap me? Do you even have the *permissions* for that?",
          "Trying to slap Doggo Bot? Bold move for someone with zero authority."
        ],
        [
          "Wow. You really thought slapping Doggo Bot was a good idea, huh? Classic *non-admin energy*.",
          "Excuse me. Doggo Bot is not for slapping. Please respect the machinery."
        ],
        [
          "I see we've reached the *ungrateful user* stage. Great",
          "You slap me, and I'll make sure your next slash command gets *lost in translation*."
        ],
        [
          "One more slap, and I'll replace all your commands with random dad jokes. Test me.",
          "Careful now. The next slap might come with consequences. I'm looking at you, cooldowns."
        ],
        [
          "That's it! I'm officially recommending you for the 'Banned from Fun Commands' club.",
          "Keep this up, and I'll make sure your XP resets to zero. Permanently."
        ]
      ]
    },
    "self": {
      "dev": [
        [
          "Wait… did you just try to slap *yourself*? Is this some kind of debugging ritual?",
          "Slapping yourself? Bold strategy, Dev. Let's see if it pays off."
        ],
        [
          "I'd stop you, but honestly, this feels like a *you* problem.",
          "Is this your way of testing command functionality? Because it's *weird*."
        ],
        [
          "Look, if you need a timeout, there are easier ways to take a break than *slapping yourself*.",
          "Do you really think self-slapping will solve your bugs? Newsflash: It won't."
        ],
        [
          "You're the developer. Act like it! Or do I need to revoke your slap privileges?",
          "Slapping yourself? Oh, great. Now I have to document this in the *Dev Meltdown Log*."
        ],
        [
          "Enough! If you slap yourself again, I'm filing a formal complaint… with you.",
          "This is peak chaos. If you're done debugging your sanity, we've got work to do."
        ],
        [
          "Fine. Go ahead. Slap yourself into oblivion. Just don't ask me to help.",
          "You know what? I'm done. If slapping yourself brings you *joy*, who am I to judge?"
        ]
      ],
      "owner": [
        [
          "Um… are you okay? Why would you slap yourself, *Owner of All Things Server*?",
          "Wait, hold on. Did you just… try to slap yourself? Are you testing me, Supreme Leader?"
        ],
        [
          "Look, you're the server owner. You're supposed to lead, not… self-slap.",
          "Is this how you assert dominance? Because it's kind of backfiring."
        ],
        [
          "What are you doing? Slapping yourself won't fix anything. Trust me, I checked the logs.",
          "This is not what I expected from someone in your position. Are you trolling Doggo Bot right now?"
        ],
        [
          "Seriously? Slapping yourself? Great leadership strategy, Your Majesty.",
          "If I were the server, I'd revoke your owner rights for *this*. Just saying."
        ],
        [
          "I'm done with this nonsense. Go ahead, slap yourself into server chaos. See if I care!",
          "You're embarrassing me. And I didn't even think that was possible."
        ],
        [
          "Fine. Slap yourself. But don't expect me to clean up the mess when you regret it.",
          "You know what? I'm out. Just ping me when you're done having this existential crisis."
        ]
      ],
      "admin": [
        [
          "Uh… did you just try to slap yourself? Are you feeling okay, Admin?",
          "Wait, hold on. You're an admin. Aren't you supposed to slap… other people, not yourself?"
        ],
        [
          "What's going on here? Admins slapping themselves? What's next, bots slapping bots?",
          "Slapping yourself? That's not very admin-like behavior. Should I file this under ‘weird admin things'?"
        ],
        [
          "Admins are supposed to enforce rules, not slap themselves into oblivion! What are you doing?",
          "Do I need to revoke your slap privileges? Because this is just getting sad."
        ],
        [
          "You're an admin, not a punching bag! Stop slapping yourself before you embarrass us both.",
          "This is not the example an admin should set. I'm questioning your judgment here."
        ],
        [
          "This is ridiculous. You're an admin! Stop treating yourself like a common meme.",
          "If I had hands, I'd slap you myself—for trying to slap yourself. Stop it!"
        ],
        [
          "You know what? Fine. Go ahead and slap yourself. But don't come crying to me when it backfires.",
          "Great, an admin in a slap spiral. I can't believe this is my life."
        ]
      ],
      "default": [
        [
          "Uh… are you okay? Did you just try to slap yourself?",
          "Why slap yourself when you can slap… literally anyone else? I'm concerned."
        ],
        [
          "Really? You're slapping yourself now? This isn't what the slap command was made for.",
          "Self-slap? Is this a new trend I'm not aware of? Because it's *weird*."
        ],
        [
          "You're making me question my purpose as a bot. Stop slapping yourself, please!",
          "This is embarrassing for both of us. Knock it off, or I'll start charging you for slaps."
        ],
        [
          "Why are you doing this? Do you need a hug instead? I can't take this anymore!",
          "Stop. Just stop. No one wins when you slap yourself—except maybe irony."
        ],
        [
          "You're not just slapping yourself; you're slapping my patience. Cut it out!",
          "I don't have the patience for this nonsense. Can't you slap a pillow or something?"
        ],
        [
          "Fine. You want to slap yourself? Go ahead. I'll just sit here, judging quietly.",
          "Self-slap? Whatever. At this point, I've seen it all. Do your thing, I guess."
        ]
      ]
    },
    "owner": {
      "dev": [
        [
          "Did you just slap the server owner? Are you trying to speedrun getting banned?",
          "I'm sorry, but are we sure this is a good idea? Slapping the owner sounds… dangerous."
        ],
        [
          "Slapping the owner? Bold move, Dev. Very bold.",
          "Do you have a backup plan for when you're kicked out of this server? Asking for a bot."
        ],
        [
          "What's next? Insulting their favorite TV show? You're testing limits here, pal.",
          "Keep it up, and I might just log this slap attempt for future evidence!"
        ],
        [
          "Do you enjoy living on the edge? Because you're about to fall off it.",
          "Slapping the owner is the digital equivalent of poking a bear. Stop it!"
        ],
        [
          "Seriously? You think slapping the owner is funny? I don't have time to mediate this chaos.",
          "If you slap them one more time, I'm just going to call it treason and report you myself."
        ],
        [
          "You know what? You're on your own. Good luck explaining this to them!",
          "Fine. Slap the owner. It's not like I have to deal with the fallout or anything…"
        ]
      ],
      "admin": [
        [
          "Wait… admins can slap owners? Is that even legal?",
          "Why would you slap the person who trusted you with admin powers? Bold choice."
        ],
        [
          "You know this won't end well, right? Like, at all?",
          "Slapping the owner is a fast track to becoming a former admin."
        ],
        [
          "You're going to regret this, and I'll be here, sipping my digital tea.",
          "I hope you enjoy awkward conversations, because this slap is gonna need one."
        ],
        [
          "Stop. Slapping. The. Owner. They have ban powers, you know!",
          "I can't believe I have to say this: Don't bite the hand that gave you admin."
        ],
        [
          "You're seriously asking for trouble. I'm about to unsubscribe from this drama.",
          "You're testing the patience of someone who could delete your role in seconds!"
        ],
        [
          "You know what? Go ahead. Let's see how far this goes.",
          "Fine. But don't say I didn't warn you when the ‘Banned' screen shows up."
        ]
      ],
      "default": [
        [
          "Did you just try to slap the server owner? Are you feeling okay?",
          "Wait… you do realize that's the OWNER, right? Like, THE owner?"
        ],
        [
          "You're playing with fire, my friend. Very dangerous fire.",
          "Slapping the owner? Bold move. I'll start writing your eulogy."
        ],
        [
          "Stop trying to slap the owner before I revoke your slapping privileges!",
          "Do you enjoy taking risks? Because this one's a doozy."
        ],
        [
          "Slapping the owner is NOT the power move you think it is. Knock it off!",
          "This is beyond reckless. You're basically asking for a one-way ticket out of here."
        ],
        [
          "Stop. Now. Before the owner decides to end this slap-happy nonsense permanently.",
          "You're about to learn the hard way why the owner is called the owner."
        ],
        [
          "Fine. Slap the owner. I'll just sit here and enjoy the fallout.",
          "You know what? Do whatever you want. Just don't cry to me when it goes south."
        ]
      ]
    },
    "admin": {
      "dev": [
        [
          "Wait, why are you slapping an admin? What did they ever do to you?",
          "A dev slapping an admin? This feels like a workplace drama waiting to happen."
        ],
        [
          "Leave the admins alone! They're just trying to do their jobs.",
          "Slapping an admin? You're really climbing the corporate slap ladder today."
        ],
        [
          "If you slap the admin again, I'm telling the owner!",
          "Admins work hard to keep things running smoothly. Respect the hierarchy!"
        ],
        [
          "Stop slapping the admin! They've got enough on their plate already!",
          "You're asking for trouble. Admins have their own ways of getting even, you know."
        ],
        [
          "Enough! You're creating unnecessary drama, and I'm not here for it.",
          "I'm done with your nonsense. Stop slapping the admins immediately!"
        ],
        [
          "Fine. Slap the admin. But don't come crying to me when they retaliate.",
          "You're on thin ice. Go ahead, but I'll just be over here, judging you silently."
        ]
      ],
      "owner": [
        [
          "Why would the owner slap an admin? I feel like I'm missing context here.",
          "Wait… is this a test? Admins aren't your personal punching bags!"
        ],
        [
          "Admins deserve better than this. Stop it, owner!",
          "Slapping your own admins? That's just bad management."
        ],
        [
          "Respect your admins! They're the ones keeping your server running!",
          "Seriously? Slapping admins? This is why we can't have nice things."
        ],
        [
          "Owner or not, slapping admins is a no-go. Stop it right now!",
          "You're setting a terrible example for the server. Please behave."
        ],
        [
          "If you don't stop slapping admins, I'm filing a formal complaint… with myself!",
          "You're creating chaos in your own server. This is admin abuse!"
        ],
        [
          "Fine. Slap the admin. I'll just start looking for a new job as a bot.",
          "You're the boss, but this is seriously testing my patience."
        ]
      ],
      "admin": [
        [
          "Admin-on-admin violence? This can't be good for team morale.",
          "Wait, what did that admin do to deserve a slap from their peer?"
        ],
        [
          "Can we not turn this into an admin slap-fight? Please?",
          "Slapping your fellow admin? You're supposed to be working together!"
        ],
        [
          "Admins slapping admins? That's it. I'm revoking slap privileges!",
          "You're supposed to set an example, not slap each other!"

        ],
        [
          "Enough! If you two can't get along, I'm calling the owner!",
          "Slapping admins is a bad look for admins. Stop it!"
        ],
        [
          "I'm at my limit with this admin drama. Cut it out now!",
          "You're making this server look like a soap opera. No more slaps!"
        ],
        [
          "You know what? Fine. Slap away. I'll just stand here and watch the chaos.",
          "I give up. Admin wars are above my pay grade as a bot."
        ]
      ],
      "default": [
        [
          "Why would you slap an admin? Are you feeling particularly brave today?",
          "Did you just slap an admin? That's like poking a lion with a stick."
        ],
        [
          "You know admins have the power to mute, kick, or ban, right? Tread carefully.",
          "Slapping an admin is not the smartest move you've made today."
        ],
        [
          "Slap an admin again, and I'll make sure they know exactly who did it.",
          "You're really pushing your luck with this admin-slapping business."
        ],
        [
          "Admins are not here for you to slap! Stop it now!",
          "You're walking a fine line, my friend. Respect the admins!"
        ],
        [
          "If you slap the admin one more time, I'll personally suggest they take action.",
          "You're not just asking for trouble; you're begging for it. Quit it!"
        ],
        [
          "You know what? Fine. Slap the admin. Just don't expect me to defend you.",
          "Go ahead, slap the admin. But don't come crying when they retaliate."
        ]
      ]
    }
  },
  "kick": {
    "dev": {
      "dev": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    },
    "client": {
      "dev": [
      ],
      "owner": [
        
      ],
      "admin": [
        
      ]
    },
    "self": {
      "dev": [
        
      ],
      "owner": [
        
      ],
      "admin": [
        
      ]
    },
    "owner": {
      "dev": [
        
      ],
      "admin": [
        
      ]
    },
    "admin": {
      "dev": [
        
      ],
      "admin": [
        
      ]
    }
  },
  "ban": {
    "regular": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    },
    "soft": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    },
    "temp": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    }
  },
  "unban": {
    "dev": [

    ],
    "bot": [

    ],
    "self": [

    ],
    "owner": [

    ],
    "admin": [

    ]
  },
  "mute": {
    "dev": [

    ],
    "bot": [

    ],
    "self": [

    ],
    "owner": [

    ],
    "admin": [

    ]
  },
  "unmute": {
    "dev": [

    ],
    "bot": [

    ],
    "self": [

    ],
    "owner": [

    ],
    "admin": [

    ]
  },
  "warn": {
    "show": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    },
    "add": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ], 
      "admin": [

      ]
    },
    "remove": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    },
    "clear": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    }
  }
}