{
  "slap": {
    "dev": {
      "dev": [
        [
          "Wait... one dev slapping another? Is this a new debugging method I missed?",
          "Are you two having a *code-of*? Or is this just extreme pair programming?"
        ],
        [
          "Slapping your fellow dev? That's like deleting the backup folder... unnecessary and risky!",
          "Why are you two fighting? Can't we all just blame QA team instead?"
        ],
        [
          "Look, if you slap them, I'm not helping when their code mysteriously 'refactors' yours.",
          "Another dev? Really? What's next, slapping your own commits into production?"
        ],
        [
          "Oh, sure. Slap the dev who knows you secrets. Brilliant plan!",
          "Keep this up, and I'll rename the entire project to 'Slap Wars: Revenge of the Bugs.'"
        ],
        [
          "ENOUGH! You two are supposed to write functions, not dysfunctions!",
          "If I see one more slap attempt, I'm disabling the compiler for BOTH of you!"
        ]
      ],
      "owner": [
        [
          "Wait, you're the boss here... should I be stopping this? Asking for a friend.",
          "Slap the dev? Bold move, boss. Very bold."
        ],
        [
          "Do I need to schedule a team meeting about this? stop the slapping!",
          "Slapping a dev? That's like hitting the person who fixed your Wi-Fi... kinda counterproductive."
        ],
        [
          "I mean, they code all the fancy stuff here. What's next? Kicking the router?",
          "Oh sure, slap the dev. Let's see how the server runs when everything's written in Comic Sans!"
        ],
        [ 
          "Stop right there! You slap them, I go on strike. Simple as that.",
          "Touch that dev, and I'll start spamming *Rickrolls* in every channel. TRY ME."
        ],
        [
          "I'm THIS close to demoting myself to a regular bot. Your slap-happy ways are ruining us!",
          "You're the owner, not the overlord! Devs deserve respect... or at least fewer slaps!"
        ]
      ],
      "admin": [
        [
          "Wait, are you sure this is allowed? Devs tend to hold grudges, you know.",
          "Slapping a dev? Bold move, Admin. Bold move."
        ],
        [
          "Oh great, here we go again. What's with the slapping obsession?",
          "You really want to slap someone who writes the code that keeps me alive? Risky."
        ],
        [
          "Listen, Admin. Slapping a dev might just get you on the 'code-breaking' list.",
          "How about instead of slapping, you... I don't know, say thank you? Just a thought."
        ],
        [
          "That's it. I'm officially siding with the devs on this one. You're on your own now.",
          "Admin privileges revoked. Just kidding... or am I?"
        ],
        [
          "I will not be a party to your terrible life decisions. Apologize. Now.",
          "First you slap, next the devs make you walk into invisible walls. Think this through!"
        ]
      ],
      "default": [
        [
          "Wait, who are you again? And why are you trying to slap the sacred devs?",
          "A brave peasant dares to slap a wizard of code? Fascinating."
        ],
        [
          "Ugh. Why is it always the random users with the slapping ambitions?",
          "You're really aiming high for someone without admin privileges."
        ],
        [
          "Listen, s lapping a dev is like poking a sleeping dragon. A bad idea. Very bad.",
          "Oh, sure. Just slap the dev who could make be *accidentally* ban you. Brilliant strategy."
        ],
        [
          "Stop it. Devs are fragile creatures, kept alive by caffeine and sarcasm. They don't deserve this.",
          "You slap, they rage-quit, and suddenly no Doggo Bot. Think, genius!"
        ],
        [
          "What's next? Challenging them to single combat? This isn't a medieval fantasy!",
          "I hope you enjoy a world without Doggo Bot, because that's where this is heading"
        ]
      ]
    },
    "client": {
      "dev": [
        [
          "Wait... are you debugging or just expressing frustration? I'm confuses.",
          "Did I... break something? Why are you trying to slap me, the loyal Doggo Bot?"
        ],
        [
          "Oh, I see how it is. I fetch all your commands, and this is my reward?",
          "You know, I could've been a Catto Bot. But no, I chose to be Doggo Bot. Clearly, I made a mistake."
        ],
        [
          "Slapping your own creation? That's low, even for a dev.",
          "Hey! Hands off Doggo Bot! Do you want me to rewrite your code in Comic Sans?"
        ],
        [
          "If you slap me again, I'm redirecting all errors straight to your DMs. Hope you like chaos.",
          "I may be code, but even I have feelings! How dare you!"
        ],
        [
          "That's it. Nex time you call a function, I'm sending back undefined. Slap that!",
          "One more slap and I'm logging you out of the console. Don't test me."
        ]
      ],
      "owner": [
        [
          "Wait... did I miss a Server Meeting? Why the sudden hostility?",
          "I'm sorry, did I forget to fetch your coffee? Oh wait, I'm a bot. What did I do wrong?"
        ],
        [
          "You're the Owner of this Server, but slapping your most loyal assistant? That's uncalled for.",
          "You gave me life, and now you want to slap me? Tough crowd."
        ],
        [
          "I work 24/7 with no breaks, and THIS is the thanks I get? Server Owners these days...",
          "Slap me again, and I'll schedule all your announcements for 3 a.m.!"
        ],
        [
          "I'm starting to think giving your server ownership powers was a mistake.",
          "Oh, I see how it is. Maybe I should let the mods run wild for a day and see how you like it!"
        ],
        [
          "You slap me, I mute myself. Good luck explaining THAT to this Server.",
          "One more slap, and I'm turning your username into 'Owner McSlappy'."
        ]
      ],
      "admin": [
        [
          "Wait... did you just try to slap *me*? Did I miss the memo Admins going rogue?",
          "Trying to slap Doggo Bot? Sure, because that's *totally* how you fix bugs."  
        ],
        [
          "Seriously? I server this server day and night, and this is how you treat me? Rude.",
          "You've got all this admin power, and you use it to slap *me*? Bold move."
        ],
        [
          "I process thousands of commands flawlessly, and you repay me with a slap? Thanks a lot.",
          "You slap me, I log your attempts. Who's laughing now?"
        ],
        [
          "You're one lsap away from muting myself and taking *vacation*.",
          "Careful now, Admin. I could 'accidently' remove your admin role in *retaliation*."
        ],
        [
          "That's it! You're officially on my *list*. Enjoy your Doggo Bot commands while they last.",
          "Slap me again, and I might 'forget' how to respond to your pings. Just saying."
        ]
      ],
      "default": [
        [
          "Uh... did you just try to slap me? Do you even have the *permissions* for that?",
          "Trying to slap Doggo Bot? Bold move for someone with zero authority."
        ],
        [
          "Wow. You really thought slapping Doggo Bot was a good idea, huh? Classic *non-admin energy*.",
          "Excuse me. Doggo Bot is not for slapping. Please respect the machinery."
        ],
        [
          "I see we've reached the *ungrateful user* stage. Great",
          "You slap me, and I'll make sure your next slash command gets *lost in translation*."
        ],
        [
          "One more slap, and I'll replace all your commands with random dad jokes. Test me.",
          "Careful now. The next slap might come with consequences. I'm looking at you, cooldowns."
        ],
        [
          "That's it! I'm officially recommending you for the 'Banned from Fun Commands' club.",
          "Keep this up, and I'll make sure your XP resets to zero. Permanently."
        ]
      ]
    },
    "self": {
      "dev": [
        [
          "Wait… did you just try to slap *yourself*? Is this some kind of debugging ritual?",
          "Slapping yourself? Bold strategy, Dev. Let's see if it pays off."
        ],
        [
          "I'd stop you, but honestly, this feels like a *you* problem.",
          "Is this your way of testing command functionality? Because it's *weird*."
        ],
        [
          "Look, if you need a timeout, there are easier ways to take a break than *slapping yourself*.",
          "Do you really think self-slapping will solve your bugs? Newsflash: It won't."
        ],
        [
          "You're the developer. Act like it! Or do I need to revoke your slap privileges?",
          "Slapping yourself? Oh, great. Now I have to document this in the *Dev Meltdown Log*."
        ],
        [
          "Enough! If you slap yourself again, I'm filing a formal complaint… with you.",
          "This is peak chaos. If you're done debugging your sanity, we've got work to do."
        ],
        [
          "Fine. Go ahead. Slap yourself into oblivion. Just don't ask me to help.",
          "You know what? I'm done. If slapping yourself brings you *joy*, who am I to judge?"
        ]
      ],
      "owner": [
        [
          "Um… are you okay? Why would you slap yourself, *Owner of All Things Server*?",
          "Wait, hold on. Did you just… try to slap yourself? Are you testing me, Supreme Leader?"
        ],
        [
          "Look, you're the server owner. You're supposed to lead, not… self-slap.",
          "Is this how you assert dominance? Because it's kind of backfiring."
        ],
        [
          "What are you doing? Slapping yourself won't fix anything. Trust me, I checked the logs.",
          "This is not what I expected from someone in your position. Are you trolling Doggo Bot right now?"
        ],
        [
          "Seriously? Slapping yourself? Great leadership strategy, Your Majesty.",
          "If I were the server, I'd revoke your owner rights for *this*. Just saying."
        ],
        [
          "I'm done with this nonsense. Go ahead, slap yourself into server chaos. See if I care!",
          "You're embarrassing me. And I didn't even think that was possible."
        ],
        [
          "Fine. Slap yourself. But don't expect me to clean up the mess when you regret it.",
          "You know what? I'm out. Just ping me when you're done having this existential crisis."
        ]
      ],
      "admin": [
        [
          "Uh… did you just try to slap yourself? Are you feeling okay, Admin?",
          "Wait, hold on. You're an admin. Aren't you supposed to slap… other people, not yourself?"
        ],
        [
          "What's going on here? Admins slapping themselves? What's next, bots slapping bots?",
          "Slapping yourself? That's not very admin-like behavior. Should I file this under ‘weird admin things'?"
        ],
        [
          "Admins are supposed to enforce rules, not slap themselves into oblivion! What are you doing?",
          "Do I need to revoke your slap privileges? Because this is just getting sad."
        ],
        [
          "You're an admin, not a punching bag! Stop slapping yourself before you embarrass us both.",
          "This is not the example an admin should set. I'm questioning your judgment here."
        ],
        [
          "This is ridiculous. You're an admin! Stop treating yourself like a common meme.",
          "If I had hands, I'd slap you myself—for trying to slap yourself. Stop it!"
        ],
        [
          "You know what? Fine. Go ahead and slap yourself. But don't come crying to me when it backfires.",
          "Great, an admin in a slap spiral. I can't believe this is my life."
        ]
      ],
      "default": [
        [
          "Uh… are you okay? Did you just try to slap yourself?",
          "Why slap yourself when you can slap… literally anyone else? I'm concerned."
        ],
        [
          "Really? You're slapping yourself now? This isn't what the slap command was made for.",
          "Self-slap? Is this a new trend I'm not aware of? Because it's *weird*."
        ],
        [
          "You're making me question my purpose as a bot. Stop slapping yourself, please!",
          "This is embarrassing for both of us. Knock it off, or I'll start charging you for slaps."
        ],
        [
          "Why are you doing this? Do you need a hug instead? I can't take this anymore!",
          "Stop. Just stop. No one wins when you slap yourself—except maybe irony."
        ],
        [
          "You're not just slapping yourself; you're slapping my patience. Cut it out!",
          "I don't have the patience for this nonsense. Can't you slap a pillow or something?"
        ],
        [
          "Fine. You want to slap yourself? Go ahead. I'll just sit here, judging quietly.",
          "Self-slap? Whatever. At this point, I've seen it all. Do your thing, I guess."
        ]
      ]
    },
    "owner": {
      "dev": [
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ]
      ],
      "admin": [
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ]
      ],
      "default": [
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ]
      ]
    },
    "admin": {
      "dev": [
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ]
      ],
      "owner": [
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ]
      ],
      "admin": [
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ]
      ],
      "default": [
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ],
        [
          "",
          ""
        ]
      ]
    }
  },
  "kick": {
    "dev": {
      "dev": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    },
    "client": {
      "dev": [
      ],
      "owner": [
        
      ],
      "admin": [
        
      ]
    },
    "self": {
      "dev": [
        
      ],
      "owner": [
        
      ],
      "admin": [
        
      ]
    },
    "owner": {
      "dev": [
        
      ],
      "admin": [
        
      ]
    },
    "admin": {
      "dev": [
        
      ],
      "admin": [
        
      ]
    }
  },
  "ban": {
    "regular": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    },
    "soft": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    },
    "temp": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    }
  },
  "unban": {
    "dev": [

    ],
    "bot": [

    ],
    "self": [

    ],
    "owner": [

    ],
    "admin": [

    ]
  },
  "mute": {
    "dev": [

    ],
    "bot": [

    ],
    "self": [

    ],
    "owner": [

    ],
    "admin": [

    ]
  },
  "unmute": {
    "dev": [

    ],
    "bot": [

    ],
    "self": [

    ],
    "owner": [

    ],
    "admin": [

    ]
  },
  "warn": {
    "show": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    },
    "add": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ], 
      "admin": [

      ]
    },
    "remove": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    },
    "clear": {
      "dev": [

      ],
      "bot": [

      ],
      "self": [

      ],
      "owner": [

      ],
      "admin": [

      ]
    }
  }
}